-- phpMyAdmin SQL Dump
-- version 4.9.5
-- https://www.phpmyadmin.net/
--
-- Host: localhost:3306
-- Generation Time: Jun 01, 2021 at 06:52 PM
-- Server version: 10.3.29-MariaDB-log
-- PHP Version: 7.3.28

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
SET AUTOCOMMIT = 0;
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- Database: `uspProject`
--

-- --------------------------------------------------------

--
-- Table structure for table `Ingredient`
--

CREATE TABLE `Ingredient` (
  `id` int(11) NOT NULL,
  `name` varchar(50) DEFAULT NULL
) ENGINE=MyISAM DEFAULT CHARSET=utf8;

--
-- Dumping data for table `Ingredient`
--

INSERT INTO `Ingredient` (`id`, `name`) VALUES
(1, 'телешко месо'),
(2, 'лук'),
(3, 'домати'),
(4, 'червен пипер'),
(5, 'грах'),
(6, 'моркови'),
(7, 'олио'),
(8, 'картофи'),
(9, 'праз'),
(10, 'краве масло'),
(11, 'наденица'),
(12, 'кашкавал'),
(13, 'яйца'),
(14, 'сирене'),
(15, 'сол'),
(16, 'соев сос'),
(17, 'пилешко месо'),
(18, 'спагети'),
(19, 'брашно'),
(20, 'галета'),
(21, 'прясно мляко'),
(22, 'магданоз'),
(23, 'кисели краставички'),
(24, 'орехи'),
(25, 'чесън'),
(26, 'копър'),
(27, 'цедено кисело мляко'),
(28, 'кисело мляко'),
(29, 'точени кори'),
(30, 'хлебна сода'),
(31, 'боб'),
(32, 'лютеница'),
(33, 'джоджен'),
(34, 'мащерка'),
(35, 'кайма'),
(36, 'хляб'),
(37, 'чубрица'),
(38, 'черен пипер'),
(39, 'броколи'),
(40, 'кафява захар'),
(41, 'джинджифил'),
(42, 'бисквити'),
(43, 'сладкарска сметана'),
(44, 'бял шоколад'),
(45, 'черен шоколад'),
(46, 'шоколад'),
(47, 'желатин'),
(48, 'какао'),
(49, 'бира'),
(50, 'фиде'),
(51, 'моцарела'),
(52, 'босилек'),
(53, 'зехтин'),
(54, 'балсамов оцет'),
(55, 'ориз'),
(56, 'чушки'),
(57, 'тиквички'),
(58, 'свинска мас'),
(59, 'ванилия'),
(60, 'лимонова кора'),
(61, 'амонячна сода'),
(62, 'захар'),
(63, 'телешко месо'),
(64, 'лук'),
(65, 'домати'),
(66, 'червен пипер'),
(67, 'грах'),
(68, 'моркови'),
(69, 'олио'),
(70, 'картофи'),
(71, 'праз'),
(72, 'краве масло'),
(73, 'наденица'),
(74, 'кашкавал'),
(75, 'яйца'),
(76, 'сирене'),
(77, 'сол'),
(78, 'соев сос'),
(79, 'пилешко месо'),
(80, 'спагети'),
(81, 'брашно'),
(82, 'галета'),
(83, 'прясно мляко'),
(84, 'магданоз'),
(85, 'кисели краставички'),
(86, 'орехи'),
(87, 'чесън'),
(88, 'копър'),
(89, 'цедено кисело мляко'),
(90, 'кисело мляко'),
(91, 'точени кори'),
(92, 'хлебна сода'),
(93, 'боб'),
(94, 'лютеница'),
(95, 'джоджен'),
(96, 'мащерка'),
(97, 'кайма'),
(98, 'хляб'),
(99, 'чубрица'),
(100, 'черен пипер'),
(101, 'броколи'),
(102, 'кафява захар'),
(103, 'джинджифил'),
(104, 'бисквити'),
(105, 'сладкарска сметана'),
(106, 'бял шоколад'),
(107, 'черен шоколад'),
(108, 'шоколад'),
(109, 'желатин'),
(110, 'какао'),
(111, 'бира'),
(112, 'фиде'),
(113, 'моцарела'),
(114, 'босилек'),
(115, 'зехтин'),
(116, 'балсамов оцет'),
(117, 'ориз'),
(118, 'чушки'),
(119, 'тиквички'),
(120, 'свинска мас'),
(121, 'ванилия'),
(122, 'лимонова кора'),
(123, 'амонячна сода'),
(124, 'захар'),
(125, 'телешко месо'),
(126, 'лук'),
(127, 'домати'),
(128, 'червен пипер'),
(129, 'грах'),
(130, 'моркови'),
(131, 'олио'),
(132, 'картофи'),
(133, 'праз'),
(134, 'краве масло'),
(135, 'наденица'),
(136, 'кашкавал'),
(137, 'яйца'),
(138, 'сирене'),
(139, 'сол'),
(140, 'соев сос'),
(141, 'пилешко месо'),
(142, 'спагети'),
(143, 'брашно'),
(144, 'галета'),
(145, 'прясно мляко'),
(146, 'магданоз'),
(147, 'кисели краставички'),
(148, 'орехи'),
(149, 'чесън'),
(150, 'копър'),
(151, 'цедено кисело мляко'),
(152, 'кисело мляко'),
(153, 'точени кори'),
(154, 'хлебна сода'),
(155, 'боб'),
(156, 'лютеница'),
(157, 'джоджен'),
(158, 'мащерка'),
(159, 'кайма'),
(160, 'хляб'),
(161, 'чубрица'),
(162, 'черен пипер'),
(163, 'броколи'),
(164, 'кафява захар'),
(165, 'джинджифил'),
(166, 'бисквити'),
(167, 'сладкарска сметана'),
(168, 'бял шоколад'),
(169, 'черен шоколад'),
(170, 'шоколад'),
(171, 'желатин'),
(172, 'какао'),
(173, 'бира'),
(174, 'фиде'),
(175, 'моцарела'),
(176, 'босилек'),
(177, 'зехтин'),
(178, 'балсамов оцет'),
(179, 'ориз'),
(180, 'чушки'),
(181, 'тиквички'),
(182, 'свинска мас'),
(183, 'ванилия'),
(184, 'лимонова кора'),
(185, 'амонячна сода'),
(186, 'захар'),
(187, 'телешко месо'),
(188, 'лук'),
(189, 'домати'),
(190, 'червен пипер'),
(191, 'грах'),
(192, 'моркови'),
(193, 'олио'),
(194, 'картофи'),
(195, 'праз'),
(196, 'краве масло'),
(197, 'наденица'),
(198, 'кашкавал'),
(199, 'яйца'),
(200, 'сирене'),
(201, 'сол'),
(202, 'соев сос'),
(203, 'пилешко месо'),
(204, 'спагети'),
(205, 'брашно'),
(206, 'галета'),
(207, 'прясно мляко'),
(208, 'магданоз'),
(209, 'кисели краставички'),
(210, 'орехи'),
(211, 'чесън'),
(212, 'копър'),
(213, 'цедено кисело мляко'),
(214, 'кисело мляко'),
(215, 'точени кори'),
(216, 'хлебна сода'),
(217, 'боб'),
(218, 'лютеница'),
(219, 'джоджен'),
(220, 'мащерка'),
(221, 'кайма'),
(222, 'хляб'),
(223, 'чубрица'),
(224, 'черен пипер'),
(225, 'броколи'),
(226, 'кафява захар'),
(227, 'джинджифил'),
(228, 'бисквити'),
(229, 'сладкарска сметана'),
(230, 'бял шоколад'),
(231, 'черен шоколад'),
(232, 'шоколад'),
(233, 'желатин'),
(234, 'какао'),
(235, 'бира'),
(236, 'фиде'),
(237, 'моцарела'),
(238, 'босилек'),
(239, 'зехтин'),
(240, 'балсамов оцет'),
(241, 'ориз'),
(242, 'чушки'),
(243, 'тиквички'),
(244, 'свинска мас'),
(245, 'ванилия'),
(246, 'лимонова кора'),
(247, 'амонячна сода'),
(248, 'захар');

-- --------------------------------------------------------

--
-- Table structure for table `Measure`
--

CREATE TABLE `Measure` (
  `id` int(11) NOT NULL,
  `name` varchar(30) DEFAULT NULL
) ENGINE=MyISAM DEFAULT CHARSET=utf8;

--
-- Dumping data for table `Measure`
--

INSERT INTO `Measure` (`id`, `name`) VALUES
(1, 'грам/a'),
(2, 'килограм/а'),
(3, 'милилитър/ра'),
(4, 'литър/ра'),
(5, 'чаена/и чаша/и'),
(6, 'чаена/и чаша/и'),
(7, 'брой/я'),
(8, 'глава/и'),
(9, 'скилидка/и'),
(10, 'кафена/и лъжица/и'),
(11, 'кафена/и чаша/и'),
(12, 'щипка/и'),
(13, 'стрък/а'),
(14, 'супена/и лъжица/и'),
(15, 'филия/и'),
(16, 'връзка/и'),
(17, 'грам/a'),
(18, 'килограм/а'),
(19, 'милилитър/ра'),
(20, 'литър/ра'),
(21, 'чаена/и чаша/и'),
(22, 'чаена/и чаша/и'),
(23, 'брой/я'),
(24, 'глава/и'),
(25, 'скилидка/и'),
(26, 'кафена/и лъжица/и'),
(27, 'кафена/и чаша/и'),
(28, 'щипка/и'),
(29, 'стрък/а'),
(30, 'супена/и лъжица/и'),
(31, 'филия/и'),
(32, 'връзка/и'),
(33, 'грам/a'),
(34, 'килограм/а'),
(35, 'милилитър/ра'),
(36, 'литър/ра'),
(37, 'чаена/и чаша/и'),
(38, 'чаена/и чаша/и'),
(39, 'брой/я'),
(40, 'глава/и'),
(41, 'скилидка/и'),
(42, 'кафена/и лъжица/и'),
(43, 'кафена/и чаша/и'),
(44, 'щипка/и'),
(45, 'стрък/а'),
(46, 'супена/и лъжица/и'),
(47, 'филия/и'),
(48, 'връзка/и'),
(49, 'грам/a'),
(50, 'килограм/а'),
(51, 'милилитър/ра'),
(52, 'литър/ра'),
(53, 'чаена/и чаша/и'),
(54, 'чаена/и чаша/и'),
(55, 'брой/я'),
(56, 'глава/и'),
(57, 'скилидка/и'),
(58, 'кафена/и лъжица/и'),
(59, 'кафена/и чаша/и'),
(60, 'щипка/и'),
(61, 'стрък/а'),
(62, 'супена/и лъжица/и'),
(63, 'филия/и'),
(64, 'връзка/и');

-- --------------------------------------------------------

--
-- Table structure for table `Recipe`
--

CREATE TABLE `Recipe` (
  `id` int(11) NOT NULL,
  `name` varchar(100) DEFAULT NULL,
  `description` varchar(500) DEFAULT NULL,
  `instructions` varchar(10000) DEFAULT NULL,
  `picture` varchar(256) NOT NULL DEFAULT 'noImage.jpg'
) ENGINE=MyISAM DEFAULT CHARSET=utf8;

--
-- Dumping data for table `Recipe`
--

INSERT INTO `Recipe` (`id`, `name`, `description`, `instructions`, `picture`) VALUES
(1, 'Телешко с грах', 'Рецептата за телешко с грах е една от онези рецепти, които ще откриете във всеки рецептурник с класически рецепти. И въпреки това, телешко с грах ще откриете по-често в обедното меню на кварталното заведение, отколкото на домашната трапеза. Някак малко позабравено това класическо ястие не е за изпускане. Наистина много вкусно, а и лесно за приготвяне, телешкото с грах е ястие, което ще зарадва семейството и ще превърне обяда в специален. ', '\r\n    Първата стъпка от рецептата за телешко с грах е подготовката на телешкото месо. Измивате го, нарязвате го на едри кубчета. Почиствате и нарязвате на ситно лука, след което в тенджера сгорещявате олиото добавяте лука и месото и запържвате за около 3-4 минути, след което добавете вода, която добре да покрие месото и оставете на къкри на слаб огън за около час, докато се свари. От време на време разбърквайте и внимавайте месото да не остане без вода, ако е нужно долейте.\r\n    Почистете морковите, нарежете ги на ситно и ги добавете към телешкото. Идва моментът, в който трябва да добавите граха. Най-добре е да ползвате замразен грах, тъй като той увира най-бързо, но ако имате под ръка грах в буркани, то спокойно можете да използвате и него. Добавете червения пипер и 1 чаена лъжица сол, добавете и почистените и нарязано на ситно домати, и оставете ястието да ври на слаб огън. След около 5-10 минути телешкото с грах ще е готово.\r\n', 'teleshkosgrah.jpg'),
(2, 'Запеканка с картофи и наденица', 'Често наричат готвенето изкуство. Още по-често обаче имаме нужда не от изкуство в кухнята, а от нещо вкусно, лесно и просто, което да внесе настроение във вечерята. Точно такава е рецептата за запеканка с картофи и наденица. Далеч от висотите на изисканите ястия, запеканката с картофи и наденица е по-подходяща за менюто на някоя пицария, а най-добрият ѝ приятел е чаша студена бира. За моментите, в които искате да съберете приятелите на вкусно похапване, а нямате време да се вихрите в кухнята. ', '\r\n    Първата стъпка от рецептата за запеканка с картофи и наденица е сваряването на картофите. Измивате картофите, слагате ги в голяма тенджера без да ги белите, заливате ги с вода и варите до пълно сваряване. \r\n    Докато картофите се варят, нарежете наденицата на парчета, нарежете и почистения праз на ситно. В тиган сгорещете маслото, добавете наденицата и праза и запържете за около 5-6 минути. Настържете кашкавала и го оставете на страна.\r\n    Картофите обелете и нарежете на кубчета, като ги поставите в тава. Добавете наденицата и праза, както и червения пипер, ½ чаена лъжица сол и ⅓ чаена чаша вода и разбъркайте добре. Печете около 15 минути в предварително загрята на 180 градуса фурна, след което поръсете кашкавала и печете още около 5 минути. Сервирайте запеканката докато е още топла.\r\n', 'zapekanka.jpg'),
(3, 'Омлет със сирене', 'Нямаш време за готвене-избираш омлет за вечеря. Искаш да хапнеш диетично и засищащо-избираш омлет за вечеря. Търсиш икономично и вкусно ястие-избираш омлет за вечеря. С други думи-омлетът е винаги добра идея! А омлетът със сирене си е просто класика. Рецептата за омлет е повече от лесна и всеки може да я приготви дори и без да чете рецепта. И все пак, ако си забравил за това гениално ястие, Супичка ще ти припомни лесната рецепта за омлет със сирене.', '\r\n    Първата стъпка от рецептата за омлет със сирене е подготовката на яйцата. Яйцата трябва да са на стайна температура. В купа разбивате яйцата заедно със солта в помощта на тел за разбиване. Яйцата трябва да са добре разбити. Използвайте тиган с диаметър 22-24 сантиметра.\r\n    Най-добре е да използвате тиган с незалепващо покритие. Сгорещете го на котлона, след което сложете в него кравето масло и го размажете по повърхността на тигана. Изсипете разбитите яйца и наклонете тигана, така че да се разпределят равномерно в тигана. Оставете тигана на котлона за 2-3 минути, докато омлетът започне да става плътен.\r\n    Натрошете сиренето и и го поръсете върху едната половина на омлета. Използвайте качествено твърдо сирене, каквото е кравето сирене Рупите на Мандра Киселово. Ако сиренето е меко, С дървена шпатула внимателно отлепете половината на омлета, захлупете я върху другата половина, прегъвайки го на две. Печете още минута-две. Сервирайте омлета със сирене с прясна салата, като доматената салата е най-подходяща.\r\n', 'omletsussirene.jpg'),
(4, 'Крем супа от картофи', 'Супите, в чиято основа стоят картофите са едни от най-популярните и най-често приготвяните супички. Крем супата от картофи е обаче може би най-любимата крем супа, на малки и на големи. За картофената крем супа няма сезон, но в началото на лятото пресните картофи са най-вкусни и затова новакът в кухнята не трябва да пропуска възможността да направи една. Безспорен плюс на крем-супата от картофи е фактът, че се приготвя много бързо, както и че необходимите продукти присъстват почти непрекъснато в ', '\r\n    Първата стъпка от рецептата за крем супа от картофи е подготовката на продуктите. Почистете картофите, моркова и лука и ги варете в подсолена вода, докато омекнат. Зеленчуците са достатъчно сварени, когато можете да ги набучите лесно с вилица. Важно е да се сварят добре, за да се получи в последствие гладка, а не хрупкава картофена крем-супа.\r\n    Пасирайте сварените зеленчуци с пасатор, или кухненски робот до получаването на еднородна смес. Не изхвърляйте водата, в която са врели зеленчуците.\r\n    Добавете към получената смес маслото, прясното мляко и около половин литър от водата, в която са врели зеленчуците. Разбъркайте добре до получаване на хомогенна смес и върнете за още 5 минути крем-супата от картофи на котлона.\r\n', 'kremsupa.jpg'),
(5, 'Кашкавал пане', 'Класика! Влизаш в класически ресторант и поръчваш кашкавал пане, без дори да четеш менюто! Или пък виенски шницел! И ако заведението е добро, знаеш, че си направил правилния избор! Какво е нужно, за да получил вкусен паниран кашкавал? Нужен е качествен кашкавал-узрял кашкавал, твърд и вкусен кашкавал. Кашкавал пане се прави лесно, а е толкова вкусен и толкова мултифункционален! Класически представител на категорията “аламинути”, панираният кашкавал може да се сервира като основно, но може да бъд', '\r\n    Първата стъпка от рецептата за кашкавал пане е подготовката на кашкавала. Нарежете кашкавала на правоъгълни или триъгълни парчета с дебелина около 1 сантиметър. Кашкавалът сложете в купа със студена вода. Изберете стегнат и твърд кашкавал, какъвто е кашкавалът на Мандра Киселово, тъй като мекият кашкавал бе се разтекъл по време на пържене. Ако ползвате мек кашкавал, то не го потапяйте във вода.\r\n    В три отделни чинии сложете брашното, разбитото яйце и галетата. В тиган сгорещете мазнината. Всяко парче кашкавал овалвате добре в брашно, след това в разбитото яйце, а накрая и в галета и пържите в добре сгорещеното олио за около минута от всяка страна, или докато придобият златист цвят.\r\n', 'kashkavalpane.jpg'),
(6, 'Снежанка', 'Руската салата и салатата Снежанка са не само най-популярните и класически празнични салати, руската салата и салатата Снежанка образуват перфектното допълнение към всяко новогодишно меню.', 'Първата стъпка от рецептата за салата Снежанка е нарязването на киселите краставички. Нарязвате краставичките на ситни кубчета и ги изсипвате в голяма купа. Към ситно нарязаните кисели краставкички добавяте смлените орехи, почистените и счукани скилидки чесън, както и ситно нарязания копър. Разбърквате добре. Имайте предвид, че ако киселите краставички са достатъчно солени не е необходимо добавянето на допълнително количество сол. Към ситно нарязаните продукти добавяте и цеденото кисело мляко. Може да използвате както готово цедено кисело мляко, така и такова приготвено от вас. Независимо какво кисело мляко използвате, то задължително следва да е достатъчно гъсто и отцедено от излишната течност, за да остане салатата Снежанка стегната. Разбъркайте добре салатата. Салатата Снежанка е вече готова за консумация. Ако не сервирате салатата веднага след приготвяне, то задължително я съхранявайте в затворен съд в хладилник.', 'snejanka.jpg'),
(7, 'Баница със сирене / извара и готови кори', 'Баница за закуска, баница за обяд, баница за вечеря! Баницата няма точно място в менюто на българина, защото той си я хапва  по всяко време във всякакви варианти. Сладката баница – баница с ябълки, баница с локум, баница с тиква, или пък в още по-популярните си солени варианти – баница със сирене, баница със спанак, баница с праз е толкова важна част от българската национална кухня, колкото са боб чорбата и зелевите сарми. Рецептата на тази баница със сирене и готови кори е една от най-лесните, ', '\r\n    Първата стъпка от рецептата за баница със сирене и готови кори е подготовката на плънката. Разбърквате яйцата (предварително извадени от хладилника), киселото мляко, изварата / сиренето, ½ чаена чаша олио и содата за хляб. Може да ползвате и извара. Ако сте ползва извара добавете и около една равна чаена лъжица сол. Разбъркайте продуктите добре до получаване на хомогенна смес.\r\n    В намазнена тавичка сложeте 1-2 листа от корите, върху които сложете около един черпак (за супа) от сместа. След което поръсете с няколко капки от останалото олио. Отгоре отново сложете лист-два от корите и отново от сместа, а накрая олио. Повтаряйте процедурата в тази последователност докато корите и сместа свършат.\r\n    Последният лист от корите намажете с олио и много внимателно нарежете с остър нож на парчета, за да можете след изпичане на по-лесно да разрежете баницата на парчета. Печете баницата в предварително загрята на 200 градуса фурна за около 30 минути, докато баницата придобие златист цвят.\r\n', 'banicasussirene.jpg'),
(8, 'Салата боб с лютеница', 'Да, има я в класическите закусвални. Да, не е нищо специално. Но салатата боб с лютеница е толкова вкусна! Може би не е необходимо да се пише рецептата за салата боб с лютеница, защото всеки знае как се приготвя. Класическа зимна салата боб с лютеница, перфектната компания за домашната ракия. Засищаща, много вкусна, в състояние да замени едно от основните хранения, салатата боб с лютеница е един представител на българската национална кухня, който не бива да бъде забравян и пренебрегван. ', '\r\n    Първата стъпка от рецептата за салата боб с лютеница е изборът и подготовката на боба. За всяка бобена салата е най-добре да използвате едър салатен боб. Накисвате боба за няколко часа, след което го сварявате както всеки път, когато приготвяте боб. Слагате боба да заври, след като заври изсипвате водата, наливате нова и отново го слагате да ври, след като заври отново излизате водата и наливате нова. Варите боба да пълно сваряване.\r\n    Бобът може да сварите и дни предварително. Към сварения и отцеден от водата боб добавяте  ситно нарязания праз, лютеницата и ситно нарязания магданоз. Добавяте и ½ чаена лъжица сол и разбърквате добре. Може да приготвите салатата и с лютеница от магазина, но определено е по-вкусна, ако заложите на домашна лютеница, защото ще е по ваш вкус.\r\n', 'salatabobslutenica.jpg'),
(9, 'Боб яхния в гювеч', 'Бобът във всяка една форма е символ на българската национална кухня. А боб яхния е не само част от кулинарните традиции, боб яхния е и основно любимо ястие, което помага за изхранването на населението. За да бъде рецептата за боб яхния в унисон с останалите рецепти в Супичка трябва да бъде най-лесната и най-бързата рецепта за приготвяне на боб. Точно такава е рецептата за боб яхния в гювеч, защото няма по-лесно от готвенето в гювеч. Ако добавите и една вкусна печена наденица ще реализирате едно ', '\r\n    Първата стъпка от рецептата за боб яхния е подготовката на боба, като във всяка рецепта за боб. Препоръчително и почти задължително е да накиснете боба във вода за няколко часа. След това го измивате, заливате го във вода и го слагате на котлона да заври. След като водата заври, сваляте тенджерата от котлона, отцеждате боба и го изсипвате в гювеча.\r\n    Почиствате и нарязвате на ситно моркова и лука, както и доматите. Може да ползвате и домати от консерва. След като сте изсипали боба в гювеча добавяте и подготвените зеленчуци, както и предвидените подправки и олиото. Добавяте и 2 чаени чаши вода и слагате гювеча във фурната. НЕ ЗАБРАВЯЙТЕ, че гювечът се слага в студена фурна, за да не се пукне. След като гювечът с боб вече е във фурната я включвате на 200 градуса. След около 30 минути намалявате градусите на фурната на 160 и оставяте за още 2 часа. 30 минути преди да приключите с печенето, извадете гювеча, добавете 1 чаена лъжица сол и разбъркайте. Върнете за още 30 минути във фурната.\r\n    Третата стъпка от рецептата за боб яхния в гювеч е по желание. Ако искате може да изпечете сочни наденички и да ги комбинирате с готовия боб, така както е поднесен боба на снимките.\r\n', 'bobqhniqvguvech.jpg'),
(10, 'Кюфетета по цариградски ', 'Рецептата за кюфтета по цариградски е една от класическите рецепти от българската национална кухня. Съчетанието на двата компонента на това ястие - картофеното пюре и пържените кюфтенца е изключително сполучливо. Освен че се приготвя лесно с достъпни съставки, рецептата за кюфтета по цариградски е подходяща и за празнично ястие, както и за ястие, с което да посрещнем гости.  ', '\r\n    Първата стъпка от рецептата за кюфтета по цариградски е приготвяне на каймата за кюфтетата и да сварите картофите. Измивате картофите и ги слагате в тенджера с вода, за да се сварят. Каймата е най-добре да бъде смес свинска и телешка., Към нея добавяте яйцето, нарязания на ситно лук, накиснатата и отцедена от водата филия хляб, 1 чаена лъжица сол, както и чубрицата и омесете добре, за да се овкуси. Оставете на страна.\r\n    Картофите варите до пълно сваряване, така че като ги бучнете с вилица, то тя да влиза спокойно в картофа. Отцеждате от водата и още докато са топли картофите ги обелвате. Поставяте картофите в купа, добавяте кравето масло нарязано на кубчета, както и прясното мляко и една чаена лъжица сол. С помощта на преса за картофи намачквате картофите и мачкате, докато получите пюре с желаната от вас консистенция.\r\n    След като картофеното пюре е готово, го покривате с капак, за да не изстине. Оформяте кюфтенцата с намазнени ръце кюфтенца от каймата с размер малко по-голям от орех, след което ги оваляйте в брашно. В тиган сгорещете олиото и изпържете кюфтенцата от всички страни. Готовите кюфтенца поставете в чиния, в която сте поставили домакинска хартия, за да се отцедят от ненужната мазнина.\r\n', 'kuftetapocarigradski.jpg'),
(11, 'Спагети с пилешко и броколи', 'Съвременното домакинство страда от една основна липса - липсата на достатъчно време. Това важи в пълна сила и за готвенето, всички сме в непрекъснато търсене на бързи и лесни за приготвяне рецепти. Точно такава, а и много вкусна е рецептата за спагети с пилешко. ', '\r\n    Първата стъпка от рецептата за спагети с пилешко и броколи е изборът и подготовката на продуктите. Може да ползвате всякакво пилешко месо, но бялото месо е най-походящо в случая. Месото трябва да е или охладено или ако напълно размразено. За спестите още малко от времето за приготвяне, нарежете пилешкото месо на хапки. Поръсете ги със сол и черен пипер и разбъркайте добре.\r\n    В тенджера сложете вода да заври, след което добавете сол и подготвените спагети. Варете според инструкциите на пакета. Ако използвате пресни броколи, накъсайте ги на розички, измийте ги и ги добавете към спагетите 3 минути преди да са готови, след което прецедете. Ако пък ползвате замразени, то ги добавете, след като спагетите са сварени и отцедени от водата. Междувременно в тиган изсипете 1 супена лъжица олио и запържете нарязаното на хапки пилешко, заедно с почистения и настърган морков.\r\n    В малка тенджера или касерола изсипете соевия сос, захарта, черния пипер, джинджифила и олиото. Разбъркайте добре, след което сложете на котлона, за да заври. Сосът добавете към пилешкото месо и оставете да поври около 5 минути. Добавете пилешкото със соса към спагетите с броколите, разбъркайте и сервирайте ястието горещо.\r\n', 'spagetispileshkoibrokoli.jpg'),
(12, 'Торта три шоколада ', 'Много вкусен сладкиш е тази торта три шоколада! Ако все още се чудиш, дали да приготвиш рецептата за торта три шоколада, то не му мисли повече! Тя е толкова вкусна и толкова извънредно лесна за приготвяне, че си заслужава на момента да отидеш до магазина, да вземеш необходимите съставки. Тортата три шоколада е истинска наслада за любителите на шоколада. Но тортата три шоколада, че се хареса и на любителите на леките сладкиши, както и на тези, които обичат парфетата. ', '\r\n    Първата стъпка от рецептата за торта три шоколада е подготовката на блата. Смилате какаовите бисквити с помощта на блендер или кухненски робот, разтопявате кравето мясло и го добавяте към бисквитите. Размесвате добре, до получаване на маслени трохи. На дъното на форма за кекс с падащи стени поставяте хартия за печене, върху която разпределяте трохите и притискате добре с ръце, до получаване на блат. Прибирате в хладилника, за да стене.\r\n    В голяма купа изсипвате сметаната и добавяте прясното мляко, след което ги разбърквате. Разпределяте тази течност на три равни части. Нарязвате първо черния шоколад на ситни парченца. Слагате 500 мл от сместа от мляко и сметана на котлона на ниска степен. Разтопявате едно пакетче желатин на водна баня, като го изсипете в чаша, добавите 4-5 супени лъжици вода, разбъркате и поставите чашата в малък съд с вода на котлона, за да се разтопи. След като млякото е топло, но в никакъв случай вряло или прекалено горещо, добавяте нарязания шоколад и започвате да бъркате с лъжица или тел за разбиване до пълно стопяване на шоколада. Добавяте разтворения желатин, разбърквате много добре и изсипвате тази смес върху блата и отново прибирате в хладилника за час-два докато стегне.\r\n    След като първият шоколадов блат е вече стегнал, пригответе втория по същия начин. В затоплената смес от мляко и сметана, добавяте нарязания на ситно млечен шоколад, както и набъбналия желатин. Разбърквате много добре и изсипвате върху върху блата и отново прибирате в хладилника. След още час-два приготвяте по същия начин и сместа с белия шоколад и оставяте така получената торта да стегне за няколко часа или една нощ. По желание поръсвате тортата с какао.\r\n', 'tortatrishokolada.jpg'),
(13, 'Картофи соте ', 'Колко ли често сервитьорът в капанчето на плажа чува следната поръчка: „Една голяма бира и едни картофи соте“… Картофите Соте присъстват в менюто на всяко заведение и са почти толкова обичани, колкото и вечните ПКС (пържени картофи със сирене ;) )Сезонът на бирата вече е тук, астрономическото лято дойде и е време за рецептите на любимите бирени мезета. А какво по-подходящо мезе за бира от картофи соте. ВНИМАНИЕ! Хората, които държат на здравословното и диетично хранене няма смисъл да четат рецеп', '\r\n    Измивате добре картофите, обелвате ги и ги слагате да поврат в подсолена вода. Картофите не трябва да стават много меки, трябва да останат полусварени, защото освен варенето ще бъдат подложени и на друга топлинна обработка и ако още в началото ги сварим, в последствие ще се разпаднат и вместо картофи соте, ще получите каша соте.\r\n    Полусварените картофи се нарязват на едри парчета и се запържват, докато придобият златиста коричка в загрятото предварително масло. Мазнината за пържене на картофите трябва да е повечко, за да се изпържат добре.\r\n    Накрая обърквате картофите със ситно нарязаните копър и чесън и ги оставяте на котлона за не повече от 1-2 минути. Възможно е нарязаните копър и чесън да добавите и след като свалите картофките от котлона и да не ги подлагате на топлинна обработка, тогава те ще останат по-свежи. Ако пък не сте любители на чесъна може да подправите картофите само с копър, макар че така вашите картофи ще се различават съществено от класическите картофи соте.\r\n', 'kartofisote.jpg'),
(14, 'Пиле с картофи на фурна', 'Има ястия, които са част от всяка кухня и въпреки, че са изключително популярни са обичани като изтънчени специалитети. Мусака, зелеви сарми, лозови сарми, пиле с ориз, печено пиле с картофи на фурна… Тези ястия бабите приготвят, когато внуците идват на гости, тези ястия, приготвяме и когато искаме да предложим на нашите гости нещо доказано вкусно. Рецептата за пиле с картофи на фурна е може би най-лесната от всичките тези любими рецепти. Подобно на много други любими ястия и пилето с картофи на', '\r\n    Първата стъпка от рецептата за пиле с картофи на фурна е подготовката на картофите. Измивате картофите, обелвате ги и ги нарязвате на едри парчета. Изсипвате картофите в голяма тава и ги посолявате с около ½ чаена лъжица сол, поръсвате с мащерка, нарязвате 1-2 скилидки чесън  и ги разбърквате добре с ръка, така че всички картофчета да се овкусят. Върху тях разпределяте 2/3 от подготвеното краве масло, като го нарежете на дребни парченца.\r\n    Измивате пилето добре, след което го намазвате с масло. Сипвате в ръката си сол и мащерка и ги разтривате по цялото пиле. В самото пиле пускате парченце масло и 1-2 нарязани на парченца скилидки чесън (в случай, че обичате аромата на чесън).\r\n    Последната стъпка от рецептата за пиле с картофи на фурна е подготовката на ястието за печене. Поставяте овкусеното пиле върху картофите, изсипвате ½ чаена чаша бира и една чаена чаша вода. Покривате цялата тава с алуминиево фолио и печете пилето с картофи в предварително загрята на 180 градуса фурна за един час. След като мине един част махате фолиото и оставяте ястието да се запече без фолио за около 10 минути.\r\n', 'pileskartofinafurna.jpg'),
(15, 'Пилешка супа със застройка', 'Някои казват, че за да бъде вкусна една пилешка супа, то тя трябва да е богата, т.е. в нея да има много зеленчуци и много пиле. Но понякога, например след тежка и дълга вечер, изпълнена с разнообразни алкохолни напитки и разнообразни и силни емоции, човек има нужда от силна пилешка супа, със силен пилешки бульон, която да му върне желанието за живот. Такава е пилешката супа със застройка.Това е една различна пилешка супичка. Различна, защото е само пилешка, а не комбинация от зеленчукова и пилеш', '\r\n    Пилешкото месо се сварява добре в подсолена вода (около 1/2 чаена лъжичка сол би трябвало да е достатъчна), след което месото се изважда, бульонът се прецежда. Колкото по-силен е бульонът толкова по-вкусна ще стане пилешката супичка. Част от месцето може да добавите накрая в супичката, а останалото да ползвате за друга манджичка, или пък да добавите към някоя свежа салата, за да стане тя по-вкусна и засищаща.\r\n    Към пилешкия бульон добавяте натрошеното фиде и варите още десетина минути, докато се свари фидето. След това бульонът се оставя да изстине. Следва застройването на пилешката супа и тук новаците в кухнята трябва да бъдат много внимателни! Застройката е малко предизвикателство за начинаещите готвачи! Яйцата и киселото мляко трябва да са на стайна температура. Разбиват се добре и се смесват с изстиналия бульон. Сместа се изсипва много много бавно, като се разбърква непрекъснато.  Ако изсипете сместа във врящия бульон, то супата, разбира се, няма да стане отровна, но яйцето ще се пресече и няма да бъде много ефектна (макар че човек никога не знае точно кой дефект би могъл да се превърне в ефект). И така застройката на пилешката супа е готова.\r\n    Накрая нарязвате на ситно копъра, добавяте го към супата и я връщате на котлона. Може да ползвате и стръкове сух копър, но в такъв случай копърът трябва да се добави към супата заедно с фидето. Бъркате непрекъснато, като внимавате да не завира, защото рискът от пресичане на яйцето и получаване на „китайска“ пилешка супа си е все така голям.\r\n', 'pileshkasupasuszastroika.jpg'),
(16, 'Салата Капрезе с домати, моцарела и босилек', 'Българите обичат да похапват сиренце под всякаква форма, но моцарелата определено не е от сирената, които ги очароват. Първата среща на много българи с моцарелата е останала и последна. Може би, защото моцарелата е безсолно сирене и когато не е овкусено е малко безвкусно. Салатата Капрезе обаче е в състояние да преобърне тези представи. Любимият на всички домат идеално се комбинира с моцарела и босилек, за да се превърне от класическа италианска салата в оригинално мезе за българската ракия, или', '\r\n    Нарязвате доматите и моцарелата на колелца и ги нареждате в чиния, като върху всяко кръгче домат поставяте по едно кръгче сирене моцарела. Може да ги наредите в кръг, като застъпвате краищата на всяко парченце, или пък да бъдат самостоятелни.\r\n    След като наредите доматите и моцарелата идва ред на босилека. Ако ползвате пресен босилек, може да поставите по едно листенце върху всяко парченце моцарела, или да го нарежете на много ситно и да поръсите върху цялата салата, както е и на снимката. Ако ползвате сух босилек, то просто поръсете салатата с него. Салатата \"Капрезе\" става много по-вкусна с пресния босилек, защото той придава много повече свежест и е много по-ароматен от сухия босилек. За жалост пресният босилек е почти \"неоткриваем\" в повечето магазини, само големите вериги предлагат свежа тази подправка. Свеж босилек има разбира се и на пазара. Най-лесно е обаче да си посеете в саксия и да си го отглеждате вкъщи. Така ще си имате свеж босилек всеки път, когато ви потрябва.\r\n    Салатата се подправя със сол и смес от зехтина и балсамовия оцет. Ако нямате балсамов оцет, или пък не обичат много много киселото, можете да подправите и само със зехтин.\r\n', 'salatakapreze.jpg'),
(17, 'Пълнени чушки / пиперки с кайма и ориз', 'Пълнените чушки с кайма и ориз се числят към типичните представители на българската национална кухня, а рецептата за пълнени чушки с месо присъства в различни варианти във всяка българска кухня. Подобно на рецептата за мусака например, рецептата за пълнени чушки с кайма и ориз спада към рецептите към които прибягваме, когато искаме да приготвим засищащо основно ястие, което да е вкусно, а същевременно непретенциозно и любимо. Вариантът на рецепта за пълнени чушки / пиперки с кайма и ориз на Супи', '\r\n    Първата стъпка от рецептата за пълнени чушки / пиперки с кайма и ориз е подготовката на продуктите. Измивате и почиствате чушките от семето, нарязвате лука на ситно, измивате и отцеждате ориза. Каква кайма ще изберете зависи от вашите предпочитания, може да е свинска, телешка или пък смес. В дълбок тиган или тенджера изсипвате олиото и след като се сгорещи добавяте лука, а след малко и ориза и запържвате за 3-4 минути, докато ориза стане стъклен. Добавяте червения пипер и 2 настъргани домата, както и 1 кафена чаша вода. След като ориза поеме течността, добавяте и каймата, като старателно разбърквате, за да не стане каймата на бучки. Добавяте черния пипер, 1 чаена лъжица сол и нарязания на ситно магданоз, разбърквате и сваляте сместа от котлона.\r\n    Пълните чушките със сместа, като запушвате всяка чушка с резен домат и ги нареждате в тава. Добавяте 1 чаена чаша вода и ги слагате да се пекат в предварително загрята 200 градуса фурна. Печете за около час, докато чушките придобият кафеникав загар.\r\n    За приготвянето на соса за пълнените чушки / пиперки с месо разбивате яйцата и киселото мляко. В сух сгорещен тиган изсипвате брашното и като разбърквате с дървена лъжица го запичате за 2-3 минути докато стане леко розово. Сваляте тигана от котлона и към препеченото брашно добавяте няколко лъжици от соса на ястието, разбърквате добре и добавяте и сместа от разбитите яйца и кисело мляко. Разбърквате до получаване на хомогенна смес.\r\n', 'pulnenichushki.jpg'),
(18, ' Доматена салата ', 'Доматите са толкова задължителни за лятото, колкото шарените яйца за Великден. Въпреки че ги има целогодишно, в края на юни и началото на пазара се появяват истинските домати – ароматни и вкусни! В основата на тази доматена салта стои, разбира се, доматът, което я превръща в истинска лятна салата.Тази доматена салaта обаче се различава от класическите любими български салати, каквито са шопската салата и овчарската салата, защото се хапва не с вилица, а с лъжица и напомня малко на испанската сту', '\r\nДоматената салата става най-вкусна и най-освежаваща, когато се приготви от добре изстудени домати. Обелвате доматите и ги настъргвате на едро ренде или пък ги нарязвате на много дребно. Не е препоръчително да ги мелите, защото тогава доматената салата ще се превърне в доматена супа. Разпределяте доматите в купички и върху тях добавяте ситно нарязаните лук и чушка / пиперка.                                                                                                                                             Забележка: Ако сиренето, което ще ползвате е по-безсолно към настърганите домати добавяте ½ чаена лъжица сол и разбърквате. \r\nСмилате или счуквате орехите и натрошавате сиренето. Добавяте от тях към всяка купичка. Поливате с малко зехтин и украсявате с листенца пресен магданоз\r\n', 'domatenasalata.jpg'),
(19, ' Пържени тиквички с млечен чеснов сос ', 'Дали рецептата за пържени тиквички с млечен чеснов сос е точно рецепта е спорно, тъй като почти всеки знае как се пържат тиквички, както и как се прави чеснов млечен сос. Рецептата за пържени тиквички с млечен чеснов сос е адресирана към истинските новаци в кухнята, които досега не са пържили тиквички. Рецептата за пържени тиквички е най-често приготвяната рецепта с тиквички в България, като рецептата почти няма вариации. Пържените тиквички са едно от емблематичните летни ястия за българската на', '\r\n    Първата стъпка от рецептата за пържени тиквички с млечен чеснов сос е подготовката на тиквичките. Измивате добре тиквичките, нарязвате ги на дебели колелца и ги поръсвате със сол, за да се осолят. Внимавайте да не нарежете тиквичките на прекалено тънки филийки, тъй като ще е трудно да ги изпържите и има голя вероятност да се скъсат и разпаднат. Изсипвате брашното в плитка чиния и овалвате всяка една от тиквичките от двете страни в брашно.\r\n    В дълбок тиган изсипвате олиото и след като е добре сгорещено слагате оваляните в брашно колелца тиквички в него, като обръщате (например с помощта на вилица) и ги запържвате и от двете страни, докато придобият леко златист цвят. Готовите тиквички поставяте в чиния, в която предварително сте поставили домакинска хартия, за да се отцедят добре от излишната мазнина.\r\n    Млечният чеснов сос приготвяте, като разбиете киселото мляко и към него добавите счуканите скилидки чесън и нарязания на ситно копър. Разбърквате добре, за да се разпределят чесъна и копъра равномерно.\r\n', 'purjvenitikvuchki.jpg'),
(20, ' Пръхкави бабини курабийки с мас', 'Няма как да не ги помниш! Курабийките с мас на баба! Или още наричани захаринки. Отиваш на гости и на масата заварваш една голяма купа или пък тава пълна с десетки курабийки! А като си тръгваш ти връчват цяла торба и си имаш вкусно похапване за цялата седмица! Толкова вкусни и толкова лесни за приготвяне, пръхкавите курабийки с мас по рецепта на баба могат се превърнат в част и от твоята кухня. И вместо да се чудиш с какво да закусиш в офиса, каква да е следобедната закуска, или пък какво да сло', '\r\n    Първата стъпка от рецептата за пръхкави бабини курабийки с мас е подготовката на продуктите. Всички продукти трябва да са на стайна температура. Свинската мас трябва да е мека, но не течна. Можете да замените свинската мас с краве масло, но тогава ще загубите много от автентичния вкус на бабината кухня. Разбирате много добре маста със захарта, като използвате миксер или тел за разбиване. Добавяте едно по едно 4 от яйцата, като продължавате да разбивате. \r\n    Разбърквате амонячната сода в киселото мляко и след като шупне го добавяте към разбитата смес. Добавяте ванилиите и лимоновата кора. Малко по малко към течната смес добавяте и брашното и замесвате гладко тесто.\r\n    От тестото оформяте топчета, които нареждате в тава, в която сте поставили хартия за печене. Намазвате с разбито яйце, поръсвате обилно със захар и печете в предварително загрята на 180 градуса фурна за около 15 минути, или докато курабийките придобият апетитен златист цвят.\r\n', 'babinikurabiismas.jpg');

-- --------------------------------------------------------

--
-- Table structure for table `RecipeIngredient`
--

CREATE TABLE `RecipeIngredient` (
  `recipe_id` int(11) NOT NULL,
  `ingredient_id` int(11) NOT NULL,
  `measure_id` int(11) DEFAULT NULL,
  `amount` double DEFAULT NULL
) ENGINE=MyISAM DEFAULT CHARSET=utf8;

--
-- Dumping data for table `RecipeIngredient`
--

INSERT INTO `RecipeIngredient` (`recipe_id`, `ingredient_id`, `measure_id`, `amount`) VALUES
(1, 1, 1, 500),
(1, 2, 7, 2),
(1, 3, 7, 3),
(1, 4, 6, 1),
(1, 5, 1, 800),
(1, 6, 7, 2),
(1, 7, 5, 0.5),
(2, 8, 1, 600),
(2, 11, 1, 300),
(2, 9, 13, 1),
(2, 12, 1, 100),
(2, 10, 14, 2),
(2, 4, 6, 1),
(3, 13, 7, 2),
(3, 15, 10, 0.5),
(3, 14, 1, 30),
(3, 10, 6, 1),
(4, 12, 1, 400),
(4, 13, 7, 1),
(4, 19, 14, 4),
(4, 20, 14, 4),
(4, 7, 3, 150),
(5, 8, 2, 1),
(5, 6, 7, 2),
(5, 2, 7, 1),
(5, 10, 1, 30),
(5, 21, 3, 100),
(5, 22, 13, 2),
(6, 23, 7, 10),
(6, 24, 1, 400),
(6, 25, 9, 3),
(6, 26, 13, 3),
(6, 27, 1, 500),
(7, 29, 1, 400),
(7, 13, 7, 4),
(7, 28, 1, 400),
(7, 14, 1, 300),
(7, 7, 5, 1),
(7, 30, 6, 1),
(8, 31, 5, 1),
(8, 9, 13, 1),
(8, 32, 5, 1),
(8, 22, 13, 2),
(9, 31, 5, 2),
(9, 6, 7, 3),
(9, 2, 8, 2),
(9, 3, 7, 3),
(9, 33, 6, 1),
(9, 34, 6, 1),
(9, 4, 6, 1),
(9, 7, 5, 1),
(10, 31, 1, 500),
(10, 13, 7, 1),
(10, 36, 15, 1),
(10, 2, 8, 1),
(10, 37, 10, 2),
(10, 38, 10, 1),
(10, 19, 14, 4),
(10, 7, 11, 1),
(10, 8, 1, 800),
(10, 10, 1, 50),
(10, 21, 3, 100),
(11, 17, 1, 300),
(11, 18, 1, 250),
(11, 39, 1, 400),
(11, 6, 7, 2),
(11, 25, 9, 3),
(11, 7, 14, 1),
(11, 16, 5, 0.5),
(11, 40, 14, 1),
(11, 7, 14, 1),
(11, 41, 6, 0.3),
(11, 38, 6, 0.25),
(12, 42, 1, 200),
(12, 10, 1, 120),
(12, 43, 4, 1),
(12, 21, 3, 500),
(12, 44, 1, 200),
(12, 45, 1, 200),
(12, 46, 1, 200),
(12, 47, 7, 3),
(12, 48, 14, 1),
(13, 8, 2, 1),
(13, 26, 13, 3),
(13, 25, 9, 3),
(13, 10, 1, 30),
(14, 21, 2, 1),
(14, 44, 2, 1),
(14, 45, 14, 3),
(14, 46, 9, 4),
(14, 47, 5, 0.5),
(14, 48, 6, 1),
(15, 17, 1, 300),
(15, 50, 1, 20),
(15, 26, 13, 3),
(15, 38, 6, 0.5),
(15, 28, 1, 200),
(15, 13, 7, 2),
(16, 3, 7, 2),
(16, 51, 7, 2),
(16, 52, 13, 2),
(16, 53, 14, 2),
(16, 54, 14, 1),
(17, 35, 1, 500),
(17, 55, 11, 1),
(17, 7, 5, 0.5),
(17, 2, 7, 2),
(17, 3, 7, 3),
(17, 56, 7, 12),
(17, 4, 6, 1),
(17, 22, 16, 0.5),
(17, 38, 6, 0.5),
(17, 28, 1, 400),
(17, 16, 14, 2),
(17, 13, 7, 2),
(18, 3, 2, 1),
(18, 2, 7, 1),
(18, 56, 7, 1),
(18, 14, 1, 100),
(18, 24, 11, 0.5),
(18, 53, 14, 2),
(19, 57, 7, 3),
(19, 7, 5, 1),
(19, 19, 14, 5),
(19, 28, 5, 1),
(19, 25, 9, 3),
(19, 26, 16, 0.5),
(20, 58, 5, 1),
(20, 19, 5, 6),
(20, 28, 5, 1),
(20, 62, 5, 1.5),
(20, 59, 7, 2),
(20, 60, 14, 1),
(20, 61, 5, 2),
(20, 13, 7, 5);

--
-- Indexes for dumped tables
--

--
-- Indexes for table `Ingredient`
--
ALTER TABLE `Ingredient`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `Measure`
--
ALTER TABLE `Measure`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `Recipe`
--
ALTER TABLE `Recipe`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `RecipeIngredient`
--
ALTER TABLE `RecipeIngredient`
  ADD KEY `fk_recipe` (`recipe_id`),
  ADD KEY `fk_ingredient` (`ingredient_id`),
  ADD KEY `fk_measure` (`measure_id`);

--
-- AUTO_INCREMENT for dumped tables
--

--
-- AUTO_INCREMENT for table `Ingredient`
--
ALTER TABLE `Ingredient`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=249;

--
-- AUTO_INCREMENT for table `Measure`
--
ALTER TABLE `Measure`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=65;

--
-- AUTO_INCREMENT for table `Recipe`
--
ALTER TABLE `Recipe`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=21;
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
